## Staging: ssm
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                     |
|--------|----------------------------------------------|
| update | `aws_ssm_parameter.docdb_password`           |
|        | `aws_ssm_parameter.docdb_username`           |
| add    | `aws_ssm_parameter.azure_openai_api_key`     |
|        | `aws_ssm_parameter.azure_openai_api_version` |
|        | `aws_ssm_parameter.azure_openai_endpoint`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ssm_parameter.azure_openai_api_key will be created
  + resource "aws_ssm_parameter" "azure_openai_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "azure_openai_api_key"
      + tags_all       = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.azure_openai_api_version will be created
  + resource "aws_ssm_parameter" "azure_openai_api_version" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "azure_openai_api_version"
      + tags_all       = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.azure_openai_endpoint will be created
  + resource "aws_ssm_parameter" "azure_openai_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "azure_openai_endpoint"
      + tags_all       = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.docdb_password will be updated in-place
  ~ resource "aws_ssm_parameter" "docdb_password" {
        id              = "docdb_password"
      + insecure_value  = (known after apply)
        name            = "docdb_password"
        tags            = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 2 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_ssm_parameter.docdb_username will be updated in-place
  ~ resource "aws_ssm_parameter" "docdb_username" {
        id              = "docdb_username"
      + insecure_value  = (known after apply)
        name            = "docdb_username"
        tags            = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + azure_openai_api_key_arn     = (known after apply)
  + azure_openai_api_version_arn = (known after apply)
  + azure_openai_endpoint_arn    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.azure_openai_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.azure_openai_api_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.azure_openai_endpoint"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.openai_api_key"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
